app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "BigBike"], ["image_url", "http://media.liveauctiongroup.net/i/14091/14278593_1.jpg?v=8CF744E911876E0"], ["price", 2], ["updated_at", "2016-06-17 17:17:57.113523"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)